def solution(엄, 준식):
    엄준식=int(not [])
    어떻게사람이름이={어엄:[엄준식-엄준식] for 어엄 in 엄}
    식 = len(엄)
    엄준식화이팅 = [엄준식-엄준식]*식
    for 어엄준식 in 준식:

        어엄준식 = 어엄준식.split()
        어떻게사람이름이[어엄준식[엄준식-엄준식]].append(어엄준식[엄준식])
        어떻게사람이름이[어엄준식[엄준식-엄준식]][엄준식-엄준식]+=엄준식
        어떻게사람이름이[어엄준식[엄준식]][엄준식-엄준식]-=엄준식

    for 준 in range(식):
        for 주운 in range(준+엄준식,식):
            if 어떻게사람이름이[엄[준]].count(엄[주운])==어떻게사람이름이[엄[주운]].count(엄[준]):
                if 어떻게사람이름이[엄[준]][엄준식-엄준식]>어떻게사람이름이[엄[주운]][엄준식-엄준식]:
                    엄준식화이팅[준]+=엄준식
                elif 어떻게사람이름이[엄[준]][엄준식-엄준식]<어떻게사람이름이[엄[주운]][엄준식-엄준식]:
                    엄준식화이팅[주운]+=엄준식
            elif 어떻게사람이름이[엄[준]].count(엄[주운])>어떻게사람이름이[엄[주운]].count(엄[준]):
                엄준식화이팅[준]+=엄준식
            else:
                엄준식화이팅[주운]+=엄준식
    return max(엄준식화이팅)